src/test/resources/com/zuora/opg/test/json/stripe_2/ideal/threeds2enrollcheck/case_01/confirmPaymentIntent_response.json

{ "id": "pi_3Pxs1u4ZWiZesCzm1OjRSsaE", "object": "payment_intent", "amount": 1000, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 0, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges?payment_intent=pi_3Pxs1u4ZWiZesCzm1OjRSsaE" }, "client_secret": "pi_3Pxs1u4ZWiZesCzm1OjRSsaE_secret_aS2GkrPixx6qNZpIo1HAoTpp1", "confirmation_method": "automatic", "created": 1726066826, "currency": "eur", "customer": "cus_QpX6xW8AqWsrUr", "description": "Zuora Payment description", "invoice": null, "last_payment_error": null, "latest_charge": null, "level3": null, "livemode": false, "metadata": {}, "next_action": { "redirect_to_url": { "return_url": "http://localhost:8080/apps/PublicHostedPageLite.do?method=handleThreeDs2Callback&tenantId=9&threeDs2Ts=1726066825179&threeDs2token=YAeKUF6fzfywF8hmvmaSYLNfm2f7AgTe&zThreeDs2TxId=40289dda91e0c7ab0191e19997810189&threeDs2PageId=40289dda91bc0e9f0191bc8b3dfd0043&submitEnabled=true&signatureType=&threeDs2OnStep=Authentication&threeDs2FormToken=z26V6D9CLFih0TeCl6ygu5WhcLlzZxSW&threeDs2Sig=Xo9HTDFifhHccIpD%252BMWw77PQW8hDAtjsq7sYAqx%252Fwsk%253D", "url": "https://pm-redirects.stripe.com/authorize/acct_103yoI4ZWiZesCzm/pa_nonce_QpX6r78pIIpp8T0llZhz5AJ1gcqtZfb" }, "type": "redirect_to_url" }, "on_behalf_of": null, "payment_method": "pm_1Pxs1W4ZWiZesCzmiLhpBHPZ", "payment_method_configuration_details": null, "payment_method_options": { "ideal": {} }, "payment_method_types": [ "ideal" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": "off_session", "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "requires_action", "transfer_data": null, "transfer_group": null }