src/test/resources/com/zuora/opg/test/json/stripe_2/ideal/threeds2enrollcheck/case_02/confirmPaymentIntent_response.json

{ "id": "pi_3Py4Ew4ZWiZesCzm113ONHEX", "object": "payment_intent", "amount": 1400, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 0, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges?payment_intent=pi_3Py4Ew4ZWiZesCzm113ONHEX" }, "client_secret": "pi_3Py4Ew4ZWiZesCzm113ONHEX_secret_8ui5VhX4wLCQJq3u5j56zIdRI", "confirmation_method": "automatic", "created": 1726113762, "currency": "eur", "customer": null, "description": "Zuora Payment description", "invoice": null, "last_payment_error": null, "latest_charge": null, "level3": null, "livemode": false, "metadata": {}, "next_action": { "redirect_to_url": { "return_url": "http://localhost:8080/apps/PublicHostedPageLite.do?method=handleThreeDs2Callback&tenantId=9&threeDs2Ts=1726113761641&threeDs2token=4k4kPJKdmKLyrC0zMx2awsCbzceW8n22&zThreeDs2TxId=40289dda91e452a00191e465c92300bc&threeDs2PageId=40289dda91bc0e9f0191bc8b3dfd0043&submitEnabled=true&signatureType=&threeDs2OnStep=Authentication&threeDs2FormToken=HusmPtgSPFZGAGNuZ7tfRhjisYGbQ6AR&threeDs2Sig=6CRoNKl2VbBmPe%252BmKNZ3ep89cZ0eTKhmwLAIPq31mew%253D", "url": "https://pm-redirects.stripe.com/authorize/acct_103yoI4ZWiZesCzm/pa_nonce_QpjiQB2zCrpfpEDADkOJDGGVL5ZI5NA" }, "type": "redirect_to_url" }, "on_behalf_of": null, "payment_method": "pm_1Py4Er4ZWiZesCzma9fw8fCM", "payment_method_configuration_details": null, "payment_method_options": { "ideal": {} }, "payment_method_types": [ "ideal" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": null, "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "requires_action", "transfer_data": null, "transfer_group": null }