src/test/resources/com/zuora/opg/test/json/stripe_2/ideal/threeds2enrollcheck/case_02/createPaymentIntent_response.json

{ "id": "pi_3Py4Ew4ZWiZesCzm113ONHEX", "object": "payment_intent", "amount": 1400, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 0, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges?payment_intent=pi_3Py4Ew4ZWiZesCzm113ONHEX" }, "client_secret": "pi_3Py4Ew4ZWiZesCzm113ONHEX_secret_8ui5VhX4wLCQJq3u5j56zIdRI", "confirmation_method": "automatic", "created": 1726113762, "currency": "eur", "customer": null, "description": "Zuora Payment description", "invoice": null, "last_payment_error": null, "latest_charge": null, "level3": null, "livemode": false, "metadata": {}, "next_action": null, "on_behalf_of": null, "payment_method": null, "payment_method_configuration_details": null, "payment_method_options": { "ideal": {} }, "payment_method_types": [ "ideal" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": null, "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "requires_payment_method", "transfer_data": null, "transfer_group": null }