src/test/resources/com/zuora/opg/test/json/stripe_2/ideal/threeds2enrollcheck/case_03/createPaymentIntent_response.json

{ "id": "pi_3Py53Q4ZWiZesCzm0md83Sih", "object": "payment_intent", "amount": 2300, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 0, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges?payment_intent=pi_3Py53Q4ZWiZesCzm0md83Sih" }, "client_secret": "pi_3Py53Q4ZWiZesCzm0md83Sih_secret_f80Nq8biQJgZ7FEJHTPFZuTNa", "confirmation_method": "automatic", "created": 1726116892, "currency": "eur", "customer": "cus_QpkYMsquT1t6rM", "description": "Zuora Payment description", "invoice": null, "last_payment_error": null, "latest_charge": null, "level3": null, "livemode": false, "metadata": {}, "next_action": null, "on_behalf_of": null, "payment_method": null, "payment_method_configuration_details": null, "payment_method_options": { "ideal": {} }, "payment_method_types": [ "ideal" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": "off_session", "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "requires_payment_method", "transfer_data": null, "transfer_group": null }